; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p0-5 - location
	p0-7 - location
	p3-0 - location
	p3-2 - location
	p3-4 - location
	p3-6 - location
	p3-8 - location
	p4-1 - location
	p4-6 - location
	p5-0 - location
	p5-4 - location
	p6-2 - location
	p7-3 - location
	p7-4 - location
	p7-8 - location
	p8-4 - location
	p9-0 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s8)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s0)
	(at package2 s5)
	(at package3 s6)
	(at package4 s9)
	(at package5 s6)
	(at package6 s9)
	(at package7 s5)
	(at package8 s6)
	(at package9 s3)
	(at package10 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 46)
	(= (time-to-drive s1 s0) 46)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 43)
	(= (time-to-drive s4 s0) 43)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 85)
	(= (time-to-drive s7 s1) 85)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 11)
	(= (time-to-drive s1 s2) 11)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 82)
	(= (time-to-drive s6 s2) 82)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 47)
	(= (time-to-drive s8 s2) 47)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 55)
	(= (time-to-drive s7 s3) 55)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 19)
	(= (time-to-drive s9 s3) 19)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 87)
	(= (time-to-drive s1 s4) 87)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 70)
	(= (time-to-drive s2 s4) 70)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 19)
	(= (time-to-drive s5 s4) 19)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 42)
	(= (time-to-drive s0 s5) 42)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 81)
	(= (time-to-drive s1 s5) 81)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 12)
	(= (time-to-drive s2 s5) 12)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 33)
	(= (time-to-drive s6 s5) 33)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 82)
	(= (time-to-drive s3 s6) 82)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 62)
	(= (time-to-drive s4 s6) 62)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 84)
	(= (time-to-drive s6 s7) 84)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 59)
	(= (time-to-drive s8 s7) 59)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 82)
	(= (time-to-drive s0 s8) 82)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 26)
	(= (time-to-drive s5 s8) 26)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 39)
	(= (time-to-drive s6 s8) 39)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 32)
	(= (time-to-drive s1 s9) 32)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 48)
	(= (time-to-drive s7 s9) 48)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s9)
	(at truck1 s2)
	(at truck3 s9)
	(at package1 s2)
	(at package2 s5)
	(at package3 s0)
	(at package4 s7)
	(at package5 s1)
	(at package6 s3)
	(at package7 s6)
	(at package9 s7)
	(at package10 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   goals met: 2 of 13
2. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   goals met: 2 of 13
3. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 13
4. (drive-truck truck3 s4 s6 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (fuel-used) from 0 to 620
   goals met: 2 of 13
5. (load-truck package3 truck3 s6)
   deleted: (at package3 s6)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 2 of 13
6. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 2 of 13
7. (drive-truck truck3 s6 s5 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 620 to 1049
   goals met: 2 of 13
8. (load-truck package7 truck3 s5)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 2 of 13
9. (drive-truck truck3 s5 s1 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 1049 to 2345
   goals met: 2 of 13
10. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 3 of 13
11. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 2345 to 2488
   goals met: 3 of 13
12. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 2488 to 3554
   goals met: 3 of 13
13. (unload-truck package7 truck3 s6)
   deleted: (in package7 truck3)
   added: (at package7 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 4 of 13
14. (drive-truck truck3 s6 s2 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 3554 to 4456
   goals met: 4 of 13
15. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 4456 to 4577
   goals met: 4 of 13
16. (drive-truck truck3 s1 s9 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   changed: (fuel-used) from 4577 to 4929
   goals met: 5 of 13
17. (load-truck package4 truck3 s9)
   deleted: (at package4 s9)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 5 of 13
18. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 13
19. (load-truck package6 truck3 s9)
   deleted: (at package6 s9)
   added: (in package6 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 5 of 13
20. (drive-truck truck3 s9 s7 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (fuel-used) from 4929 to 5697
   goals met: 4 of 13
21. (unload-truck package4 truck3 s7)
   deleted: (in package4 truck3)
   added: (at package4 s7)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 5 of 13
22. (drive-truck truck3 s7 s9 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   changed: (fuel-used) from 5697 to 6321
   goals met: 6 of 13
23. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (fuel-used) from 6321 to 6441
   goals met: 5 of 13
24. (drive-truck truck1 s5 s0 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 6441 to 6861
   goals met: 5 of 13
25. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 13
26. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 6861 to 7367
   goals met: 5 of 13
27. (drive-truck truck3 s9 s3 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s3)
   changed: (fuel-used) from 7367 to 7614
   goals met: 4 of 13
28. (load-truck package9 truck3 s3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 4 of 13
29. (load-truck package10 truck3 s3)
   deleted: (at package10 s3)
   added: (in package10 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 4 of 13
30. (drive-truck truck3 s3 s6 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 7614 to 9254
   goals met: 4 of 13
31. (drive-truck truck3 s6 s8 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   changed: (fuel-used) from 9254 to 10034
   goals met: 4 of 13
32. (drive-truck truck1 s1 s9 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s9)
   changed: (fuel-used) from 10034 to 10386
   goals met: 4 of 13
33. (drive-truck truck3 s8 s0 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   changed: (fuel-used) from 10386 to 12026
   goals met: 4 of 13
34. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 5 of 13
35. (drive-truck truck3 s0 s8 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s8)
   changed: (fuel-used) from 12026 to 13338
   goals met: 5 of 13
36. (drive-truck truck1 s9 s1 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (fuel-used) from 13338 to 13690
   goals met: 5 of 13
37. (drive-truck truck3 s8 s7 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s7)
   changed: (fuel-used) from 13690 to 14634
   goals met: 5 of 13
38. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 14634 to 14755
   goals met: 6 of 13
39. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 13
40. (unload-truck package9 truck3 s7)
   deleted: (in package9 truck3)
   added: (at package9 s7)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 8 of 13
41. (drive-truck truck3 s7 s3 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   changed: (fuel-used) from 14755 to 15470
   goals met: 8 of 13
42. (unload-truck package6 truck3 s3)
   deleted: (in package6 truck3)
   added: (at package6 s3)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 9 of 13
43. (drive-truck truck3 s3 s9 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   changed: (fuel-used) from 15470 to 15679
   goals met: 10 of 13
44. (drive-truck truck3 s9 s1 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   changed: (fuel-used) from 15679 to 16031
   goals met: 9 of 13
45. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 16031 to 16152
   goals met: 9 of 13
46. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 9 of 13
47. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 10 of 13
48. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 13
49. (unload-truck package10 truck3 s2)
   deleted: (in package10 truck3)
   added: (at package10 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 11 of 13
50. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 16152 to 16262
   goals met: 11 of 13
51. (drive-truck truck3 s1 s9 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   changed: (fuel-used) from 16262 to 16582
   goals met: 12 of 13
52. (disembark-truck driver2 truck3 s9)
   deleted: (driving driver2 truck3)
   added: (at driver2 s9) (empty truck3)
   goals met: 13 of 13
